ISUSim3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.34;

boundaryField
{

    "(atmosphere|atmosphereTop)"
	{
		type			inletOutlet;
        value           $internalField;
        inletValue      $internalField;
	}
    tornadoSimulator
    {
        type            fixedValue;
	value		uniform 0;
    }
    ground
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //

