ISUSim3D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(atmosphere|atmosphereTop)"
	{
		type			calculated;
        value           uniform 0;
	}
    tornadoSimulator
    {
        type            calculated;
	value		uniform 0;
    }
    ground
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
