ISUSim3D/system/FOinlet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FOinlet
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   1;
    setFormat       probes;
    fields          ( U );
    operation       volAverage;
    regionType      cellZone;
    name            actuationDiskMain;
    writeFields     false;
}

FOinletMAG
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   1;
    setFormat       probes;
    fields          ( U );
    operation       volAverage;
    regionType      cellZone;
    name            actuationDiskMain;
    writeFields     false;
    postOperation   mag;
}

// ************************************************************************* //

